Revit 2026 API

# TaskDialogExtraCheckBoxText Property

---

ExtraCheckBoxText is used to label the extra checkbox.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ExtraCheckBoxText { get; set; }
```
```vb
Public Property ExtraCheckBoxText As String
	Get
	Set
```
```cpp
public:
property String^ ExtraCheckBoxText {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ExtraCheckBoxText : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if the TaskDialog also has EnableMarqueeProgressBar set as the two cannot coincide in the same TaskDialog. |

If ExtraCheckBoxText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasExtraCheckBoxChecked() method.

#### Reference

TaskDialog Class

Autodesk.Revit.UI Namespace